#encoding:utf-8
class SpiderConf:
    def __init__(self):
        self.site_map = {'qy':{'code':'1','sname':'穷游','url':'http://z.qyer.com/free'},'qn':{'code':'2','sname':'去哪','url':'http://tuan.qunar.com/vc/zt/tejia_get_all_list.php'},'alx':{'code':'3','sname':'爱旅行','url':'http://www.ilvxing.com/'},'llh':{'code':'4','sname':'来来会','url':'http://www.lailaihui.com/'},'jkcf':{'code':'5','sname':'即刻出发','url':'http://www.jikechufa.com/'},'zm':{'code':'6','sname':'360','url':'http://go.360.cn/top10'}}
        #self.dest_code_conf = {'DNY':{'qy':['10_215','10_570','10_216','10_219','10_213','10_446','10_511','10_232','10_558','10_220','10_537','10_497']},'HDY':{'qy':['10_215#普吉岛|苏梅岛','10_233#济州岛','10_497','239_522','239_447','239_1072','76_503',]},'GAT':{'qy':['10_1966','10_1967','10_1968']},'RHY':{'qy':['10_14','10_233']},'GNY':{},'QTY':{'qy':['239_240','239_241','239_244','12_189','12_186','12_206','234_236','234_238']}}
        self.dest_code_conf = {'DNY':{'qy':['10_215','10_570','10_216','10_219','10_213','10_446','10_511','10_232','10_558','10_220','10_537','10_497'],'qn':'东南亚'},'HDY':{'qy':['10_215','10_233','10_497','239_522','239_447','239_1072','76_503',],'qn':'海岛'},'GAT':{'qy':['10_1966','10_1967','10_1968'],'qn':'港澳台'},'RHY':{'qy':['10_14','10_233'],'qn':'日韩'},'GNY':{'qy':[],'qn':'国内'},'QTY':{'qy':['239_240','239_241','239_244','12_189','12_186','12_206','234_236','234_238'],'qn':'其他'}}

        self.jkcf = {'from':{'1':'北京/天津','2':'北京/天津','3':'上海/杭州','4':'上海/杭州','5':'成都/重庆','6':'成都/重庆','7':'广州/深圳/香港','8':'广州/深圳/香港','9':'广州/深圳/香港'},'to':{'7':'香港','9':'台湾','13':'日本','15':'泰国','10':'韩国','63':'马尔代夫','11':'巴厘岛','39':'美国','3':'欧洲','18':'泰国','21':'印度','62':'菲律宾','65':'埃及','17':'柬埔寨','64':'斯里兰卡','53':'塞舌尔','54':'毛里求斯','12':'新加坡','5':'大洋洲'}}

        self.qy = {'from':{'1':'北京/天津','2':'上海/杭州','3':'成都/重庆','4':'广州/深圳','5':'港澳台','6':'国内其他','7':'海外'},'to':{'10_215':'泰国','10_231':'印度','10_446':'菲律宾','10_570':'印度尼西亚','10_216':'越南','10_219':'柬埔寨','10_213':'马来西亚','10_511':'缅甸','10_232':'新加坡','10_558':'文莱','10_220':'尼泊尔','10_537':'斯里兰卡','10_497':'马尔代夫','10_233':'韩国','239_522':'帕劳','239_447':'斐济','239_1072':'关岛','76_503':'毛里求斯','10_1966':'香港','10_1967':'澳门','10_1968':'台湾','10_14':'日本','10_233':'韩国','239_240':'澳大利亚','239_241':'新西兰','12_189':'意大利','12_186':'法国','12_206':'希腊','234_236':'美国','234_238':'加拿大'}}

        self.qn = {'from':{'%e5%8c%97%e4%ba%ac%2f%e5%a4%a9%e6%b4%a5':'北京/天津','%e6%b1%9f%e6%b5%99%e6%b2%aa':'上海/杭州','%e6%88%90%e9%83%bd%2f%e9%87%8d%e5%ba%86':'成都/重庆','%e5%b9%bf%e6%b7%b1':'广州/深圳'},'to':{'%e6%b5%b7%e5%b2%9b':'海岛','%e6%b8%af%e6%be%b3%e5%8f%b0':'港澳台','%e6%97%a5%e9%9f%a9':'日韩','%e4%b8%9c%e5%8d%97%e4%ba%9a':'东南亚','%e6%ac%a7%e7%be%8e':'欧美'}}

        self.alx = {'from':{'1':'北京/天津','2':'上海/杭州','5':'成都/重庆','3':'广州/深圳/香港','4':'武汉/长沙'},'to':{'16':'沙巴','119':'日本','8':'泰国','112':'韩国','47':'马尔代夫','390':'台湾','12':'普吉岛','23':'长滩岛','39':'塞班岛'}}

        self.llh = {'from':{'bj_tj':'北京/天津','sh_hangzhou':'上海/杭州','cd_cq':'成都/重庆','gz_sz_xg_am_tw':'广州/港澳','qd_sjz':'青岛/石家庄'},'to':{'shaba':'沙巴','riben':'日本','taiguo':'泰国','hanguo':'韩国','maerdaifu':'马尔代夫','taiwan':'台湾','pujidao':'普吉岛','malaixiya':'马来西亚','balidao':'巴厘岛'}}

    def get_from_code_conf(self):
        return self.from_code_conf

    def get_from_code_det(self, fromcode, site):
        if self.from_code_conf[fromcode][site]:
            return self.from_code_conf[fromcode][site]
        return ''
    
    def get_dest_code_conf(self):
        return self.dest_code_conf

    def get_dest_code_det(self, destcode, site):
        if self.dest_code_conf[destcode][site]:
            return self.dest_code_conf[destcode][site]
        return ''

    def get_web_site_conf(self):
        return self.site_map

    def getUrlBase(self,name):
        if name == 'jkcf':
            return self.jkcf
        if name == 'qy':
            return self.qy
        if name == 'qn':
            return self.qn
        if name == 'alx':
            return self.alx
        if name == 'llh':
            return self.llh
